omenLee870/ZXH-SH-AISRC/Drivers/PY32F072E_HAL_Driver/Inc/py32f072e_hal_comp.h
#define IS_COMP_HYSTERESIS(__HYSTERESIS__)  (((__HYSTERESIS__) == COMP_HYSTERESIS_DISABLE)   || \
                                             ((__HYSTERESIS__) == COMP_HYSTERESIS_ENABLE))


#define IS_COMP_VREFSRC(__VREF__)           (((__VREF__) == COMP_VREF_SRC_VCCA)   || \
                                             ((__VREF__) == COMP_VREF_SRC_VREFBUF1P5V)   || \
                                             ((__VREF__) == COMP_VREF_SRC_VREFBUF2P048V)   || \
                                             ((__VREF__) == COMP_VREF_SRC_VREFBUF2P5V)   || \
                                             ((__VREF__) == COMP_VREF_SRC_VREF1P2V))


#define IS_COMP_VREFDIV(__VREF__)           (((__VREF__) == COMP_VREF_DIV_1_64VREF)   || \
                                             ((__VREF__) == COMP_VREF_DIV_2_64VREF)   || \
                                             ((__VREF__) == COMP_VREF_DIV_3_64VREF)   || \
                                             ((__VREF__) == COMP_VREF_DIV_4_64VREF)   || \
                                             ((__VREF__) == COMP_VREF_DIV_5_64VREF)   || \
                                             ((__VREF__) == COMP_VREF_DIV_6_64VREF)   || \
                                             ((__VREF__) == COMP_VREF_DIV_7_64VREF)   || \
                                             ((__VREF__) == COMP_VREF_DIV_8_64VREF)   || \
                                             ((__VREF__) == COMP_VREF_DIV_9_64VREF)   || \
                                             ((__VREF__) == COMP_VREF_DIV_10_64VREF)   || \
                                             ((__VREF__) == COMP_VREF_DIV_11_64VREF)   || \
                                             ((__VREF__) == COMP_VREF_DIV_12_64VREF)   || \
                                             ((__VREF__) == COMP_VREF_DIV_13_64VREF)   || \
                                             ((__VREF__) == COMP_VREF_DIV_14_64VREF)   || \
                                             ((__VREF__) == COMP_VREF_DIV_15_64VREF)   || \
                                             ((__VREF__) == COMP_VREF_DIV_16_64VREF)   || \
                                             ((__VREF__) == COMP_VREF_DIV_17_64VREF)   || \
                                             ((__VREF__) == COMP_VREF_DIV_18_64VREF)   || \
                                             ((__VREF__) == COMP_VREF_DIV_19_64VREF)   || \
                                             ((__VREF__) == COMP_VREF_DIV_20_64VREF)   || \
                                             ((__VREF__) == COMP_VREF_DIV_21_64VREF)   || \
                                             ((__VREF__) == COMP_VREF_DIV_22_64VREF)   || \
                                             ((__VREF__) == COMP_VREF_DIV_23_64VREF)   || \
                                             ((__VREF__) == COMP_VREF_DIV_24_64VREF)   || \
                                             ((__VREF__) == COMP_VREF_DIV_25_64VREF)   || \
                                             ((__VREF__) == COMP_VREF_DIV_26_64VREF)   || \
                                             ((__VREF__) == COMP_VREF_DIV_27_64VREF)   || \
                                             ((__VREF__) == COMP_VREF_DIV_28_64VREF)   || \
                                             ((__VREF__) == COMP_VREF_DIV_29_64VREF)   || \
                                             ((__VREF__) == COMP_VREF_DIV_30_64VREF)   || \
                                             ((__VREF__) == COMP_VREF_DIV_31_64VREF)   || \
                                             ((__VREF__) == COMP_VREF_DIV_32_64VREF)   || \
                                             ((__VREF__) == COMP_VREF_DIV_33_64VREF)   || \
                                             ((__VREF__) == COMP_VREF_DIV_34_64VREF)   || \
                                             ((__VREF__) == COMP_VREF_DIV_35_64VREF)   || \
                                             ((__VREF__) == COMP_VREF_DIV_36_64VREF)   || \
                                             ((__VREF__) == COMP_VREF_DIV_37_64VREF)   || \
                                             ((__VREF__) == COMP_VREF_DIV_38_64VREF)   || \
                                             ((__VREF__) == COMP_VREF_DIV_39_64VREF)   || \
                                             ((__VREF__) == COMP_VREF_DIV_40_64VREF)   || \
                                             ((__VREF__) == COMP_VREF_DIV_41_64VREF)   || \
                                             ((__VREF__) == COMP_VREF_DIV_42_64VREF)   || \
                                             ((__VREF__) == COMP_VREF_DIV_43_64VREF)   || \
                                             ((__VREF__) == COMP_VREF_DIV_44_64VREF)   || \
                                             ((__VREF__) == COMP_VREF_DIV_45_64VREF)   || \
                                             ((__VREF__) == COMP_VREF_DIV_46_64VREF)   || \
                                             ((__VREF__) == COMP_VREF_DIV_47_64VREF)   || \
                                             ((__VREF__) == COMP_VREF_DIV_48_64VREF)   || \
                                             ((__VREF__) == COMP_VREF_DIV_49_64VREF)   || \
                                             ((__VREF__) == COMP_VREF_DIV_50_64VREF)   || \
                                             ((__VREF__) == COMP_VREF_DIV_51_64VREF)   || \
                                             ((__VREF__) == COMP_VREF_DIV_52_64VREF)   || \
                                             ((__VREF__) == COMP_VREF_DIV_53_64VREF)   || \
                                             ((__VREF__) == COMP_VREF_DIV_54_64VREF)   || \
                                             ((__VREF__) == COMP_VREF_DIV_55_64VREF)   || \
                                             ((__VREF__) == COMP_VREF_DIV_56_64VREF)   || \
                                             ((__VREF__) == COMP_VREF_DIV_57_64VREF)   || \
                                             ((__VREF__) == COMP_VREF_DIV_58_64VREF)   || \
                                             ((__VREF__) == COMP_VREF_DIV_59_64VREF)   || \
                                             ((__VREF__) == COMP_VREF_DIV_60_64VREF)   || \
                                             ((__VREF__) == COMP_VREF_DIV_61_64VREF)   || \
                                             ((__VREF__) == COMP_VREF_DIV_62_64VREF)   || \
                                             ((__VREF__) == COMP_VREF_DIV_63_64VREF)   || \
                                             ((__VREF__) == COMP_VREF_DIV_VREF))

#define IS_COMP_OUTPUTPOL(__POL__)          (((__POL__) == COMP_OUTPUTPOL_NONINVERTED) || \
                                             ((__POL__) == COMP_OUTPUTPOL_INVERTED))


#define IS_COMP_TRIGGERMODE(__MODE__)       (((__MODE__) == COMP_TRIGGERMODE_NONE)                 || \
                                             ((__MODE__) == COMP_TRIGGERMODE_IT_RISING)            || \
                                             ((__MODE__) == COMP_TRIGGERMODE_IT_FALLING)           || \
                                             ((__MODE__) == COMP_TRIGGERMODE_IT_RISING_FALLING)    || \
                                             ((__MODE__) == COMP_TRIGGERMODE_EVENT_RISING)         || \
                                             ((__MODE__) == COMP_TRIGGERMODE_EVENT_FALLING)        || \
                                             ((__MODE__) == COMP_TRIGGERMODE_EVENT_RISING_FALLING))

#define IS_COMP_OUTPUT_LEVEL(__OUTPUT_LEVEL__) (((__OUTPUT_LEVEL__) == COMP_OUTPUT_LEVEL_LOW)     || \
                                                ((__OUTPUT_LEVEL__) == COMP_OUTPUT_LEVEL_HIGH))

/**
  * @}
  */

/**
  * @}
  */


/* Exported functions --------------------------------------------------------*/
/** @addtogroup COMP_Exported_Functions
  * @{
  */

/** @addtogroup COMP_Exported_Functions_Group1
  * @{
  */

/* Initialization and de-initialization functions  **********************************/
HAL_StatusTypeDef HAL_COMP_Init(COMP_HandleTypeDef *hcomp);
HAL_StatusTypeDef HAL_COMP_DeInit(COMP_HandleTypeDef *hcomp);
void              HAL_COMP_MspInit(COMP_HandleTypeDef *hcomp);
void              HAL_COMP_MspDeInit(COMP_HandleTypeDef *hcomp);

#if (USE_HAL_COMP_REGISTER_CALLBACKS == 1)
/* Callbacks Register/UnRegister functions  ***********************************/
HAL_StatusTypeDef HAL_COMP_RegisterCallback(COMP_HandleTypeDef *hcomp, HAL_COMP_CallbackIDTypeDef CallbackID,
    pCOMP_CallbackTypeDef pCallback);
HAL_StatusTypeDef HAL_COMP_UnRegisterCallback(COMP_HandleTypeDef *hcomp, HAL_COMP_CallbackIDTypeDef CallbackID);
#endif /* USE_HAL_COMP_REGISTER_CALLBACKS */
/**
  * @}
  */

/* IO operation functions  *****************************************************/
/** @addtogroup COMP_Exported_Functions_Group2
  * @{
  */
HAL_StatusTypeDef HAL_COMP_Start(COMP_HandleTypeDef *hcomp);
HAL_StatusTypeDef HAL_COMP_Stop(COMP_HandleTypeDef *hcomp);
void              HAL_COMP_IRQHandler(COMP_HandleTypeDef *hcomp);
/**
  * @}
  */

/* Peripheral Control functions  ************************************************/
/** @addtogroup COMP_Exported_Functions_Group3
  * @{
  */
uint32_t          HAL_COMP_GetOutputLevel(COMP_HandleTypeDef *hcomp);
/* Callback in interrupt mode */
void              HAL_COMP_TriggerCallback(COMP_HandleTypeDef *hcomp);
/**
  * @}
  */

/* Peripheral State functions  **************************************************/
/** @addtogroup COMP_Exported_Functions_Group4
  * @{
  */
HAL_COMP_StateTypeDef HAL_COMP_GetState(COMP_HandleTypeDef *hcomp);
uint32_t              HAL_COMP_GetError(COMP_HandleTypeDef *hcomp);
/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* PY32F072E_HAL_COMP_H */

/************************ (C) COPYRIGHT Puya *****END OF FILE****/
